Свиток Деяния "Калькулятор"

Глаголю народу: "╔══════════════════════╗",
Глаголю народу: "║  Великий Калькулятор  ║",
Глаголю народу: "╚══════════════════════╝",

Вопрошаю гостя: "Введи первое число: " и наречь Первое,
Повелеваю: Отныне оборотить Первое в Число Дробное именоваться Первое,

Вопрошаю гостя: "Введи второе число: " и наречь Второе,
Повелеваю: Отныне оборотить Второе в Число Дробное именоваться Второе,

Повелеваю: Отныне Первое сложить с Второе именоваться Сумма,
Повелеваю: Отныне Первое отнять Второе именоваться Разность,
Повелеваю: Отныне Первое умножить на Второе именоваться Произведение,

Вещаю: "Сложить: [Сумма]",
Вещаю: "Отнять: [Разность]",
Вещаю: "Умножить: [Произведение]",

Суд вершу:
      Коль Второе не ровня 0:
            Повелеваю: Отныне Первое разделить на Второе именоваться Частное,
            Вещаю: "Разделить: [Частное]",
      Иначе:
            Вещаю: "Делить на нуль — грех великий!",

Повелеваю: Начать выполнение!
